
&НаКлиенте
Процедура Грань1(Команда)
	точка5 = Истина;  	
КонецПроцедуры

&НаКлиенте
Процедура Грань2(Команда)
	точка1 = Истина; 
	точка9 = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Грань3(Команда)
	точка1 = Истина;
	точка5 = Истина;
	точка9 = Истина;
КонецПроцедуры


&НаКлиенте
Процедура Грань4(Команда)
	
	Точка1  = истина;
	Точка7  = истина;
	Точка3  = истина;
    Точка9  = истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура Грань5(Команда)
	
	Точка1  = истина;
	Точка5  = истина;
	Точка7  = истина;
	Точка3  = истина;
    Точка9  = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Грань6(Команда)
	
	Точка1  = истина;
	Точка4  = истина;
	Точка7  = истина;
	Точка3  = истина;
	Точка6  = истина;
    Точка9  = истина;
	
КонецПроцедуры
