
&НаКлиенте
Процедура Грань4(Команда)
	
	Точка1  = истина;
	Точка7  = истина;
	Точка3  = истина;
    Точка9  = истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура Грань5(Команда)
	
	Точка1  = истина;
	Точка5  = истина;
	Точка7  = истина;
	Точка3  = истина;
    Точка9  = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Грань6(Команда)
	
	Точка1  = истина;
	Точка4  = истина;
	Точка7  = истина;
	Точка3  = истина;
	Точка6  = истина;
    Точка9  = истина;
	
КонецПроцедуры


&НаКлиенте
Процедура Грань9(Команда)
	// Очистить грань
	точка1 = ложь;
	точка2 = ложь;
	точка3 = ложь;
	точка4 = ложь;
	точка5 = ложь;
	точка6 = ложь;
	точка7 = ложь;
	точка8 = ложь;
	точка9 = ложь; 
	
	// Поставить точки
	точка1 = истина;
	точка4 = истина;
	точка7 = истина;
	точка3 = истина;
	точка6 = истина;
	точка9 = истина;
	
КонецПроцедуры

